{
    "roles": {
        "altruist": "The Altruist is a Crewmate that is capable of reviving dead players. Upon finding a dead body, the Altruist can hit their revive button, risking sacrificing themselves for the revival of another player. If enabled, the dead body disappears, so only they Altruist's body remains at the scene. After a set period of time, the player will be resurrected, if the revival isn't interrupted.",
        "amnesiac": "The Amnesiac is a Neutral role with no win condition. They have zero tasks and are essentially roleless. However, they can remember a role by finding a dead player. Once they remember their role, they go on to try win with their new win condition.",
        "arsonist": "The Arsonist is a Neutral role with its own win condition. They have the ability to douse other players with gasoline. Once they have doused every player remaining, they can Ignite everyone at once. Upon Igniting every player, they win the game.",
        "blackmailer": "The Blackmailer is an Impostor that can silence people in meetings. During each round, the Blackmailer can go up to someone and blackmail them. This prevents the blackmailed person from speaking during the next meeting.",
        "bomber": "The Bomber is an Impostor who can plant bombs around the map. When a bomb is planted it will detonate x seconds later (according to settings). Once detonated the bomb will kill anyone in the radius of the blast, including themselves or teammates.",
        "detective": "The Detective is a Crewmate that can examine other players for suspicious behaviour. If the player the Detective examines has killed recently the Detective will be alerted about it.",
        "disperser": "The Disperser is an Impostor who has a 1 time use ability to send all players to a random vent. This includes miner vents. Does not appear on Airship or Submerged.",
        "doubleshot": "Double Shot is an Impostor who gets an extra life when assassinating. Once they use their life they are indicated with a red flash and can no longer guess the person who they guessed wrong for the remainder of that meeting.",
        "engineer": "The Engineer is a Crewmate that can fix sabotages from anywhere on the map. They can use vents to get across the map easily.",
        "escapist": "The Escapist is an Impostor that can teleport to a different location. Once per round the Escapist can Mark a location which they can then escape to later in the round.",
        "executioner": "The Executioner is a Neutral role with its own win condition. Their goal is to vote out a player, specified in the beginning of a game. If that player gets voted out, they win the game.",
        "glitch": "The Glitch is a Neutral role with its own win condition. The Glitch's aim is to kill everyone and be the last person standing. The Glitch can Hack players, resulting in them being unable to report bodies and do tasks. Hacking prevents the hacked player from doing anything but walk around the map. The Glitch can Mimic someone, which results in them looking exactly like the other person.",
        "grenadier": "The Grenadier is an Impostor that can throw smoke grenades. During the game, the Grenadier has the option to throw down a smoke grenade which blinds crewmates so they can't see. However, a sabotage and a smoke grenade can not be active at the same time.",
        "guardianangel": "The Guardian Angel is a Neutral role which aligns with the faction of their target. Their job is to protect their target at all costs. If their target loses, they lose.",
        "haunter": "The Haunter is a dead Crewmate that can reveal Impostors if they finish all their tasks. Upon finishing all of their tasks, Impostors are revealed to alive crewmates after a meeting is called. However, if the Haunter is clicked they lose their ability to reveal Impostors and are once again a normal ghost.",
        "imitator": "The Imitator is a crewmate who can use fallen crewmates to their advantage. During meetings the Imitator can select a player who they wish to imitate the following round. They will not know what role they are imitating until the following round.",
        "investigator": "The Investigator is a Crewmate that can see the footprints of players. Every footprint disappears after a set amount of time.",
        "janitor": "The Janitor is an Impostor that can clean up bodies. Both their Kill and Clean ability have a shared cooldown, meaning they have to choose which one they want to use.",
        "jester": "The Jester is a Neutral role with its own win condition. If they are voted out after a meeting, the game finishes and they win. However, the Jester does not win if the Crewmates, Impostors or another Neutral role wins.",
        "juggernaut": "The Juggernaut is a neutral role who needs to kill everyone to win. The Juggernaut's special quirk is that they have an altered kill cooldown which decreases with each kill. The starting kill cooldown is the Glitch kill cooldown plus 5 seconds.",
        "lovers": "The Lovers are two players who are linked together. These two players get picked randomly between Crewmates and Impostors. They gain the primary objective to stay alive together. If they are both among the last 3 players, they win.",
        "mayor": "The Mayor is a Crewmate that can vote multiple times. The Mayor has a Vote Bank, which is the number of times they can vote. They have the option to abstain their vote during a meeting, adding that vote to the Vote Bank. As long as not everyone has voted, the Mayor can use as many votes from their Vote Bank as they please.",
        "medic": "The Medic is a Crewmate that can give any player a shield that will make them immortal until the Medic dies. A Shielded player cannot be Shifted into, Hacked or Killed by anyone, unless by suicide.",
        "medium": "The Medium is a Crewmate that can see ghosts. During each round the Medium has an ability called Mediate. If the Medium uses this ability and no one is dead, nothing will happen. However, if someone is dead, the Medium and the dead player will be able to see each other and communicate from beyond the grave!",
        "miner": "The Miner is an Impostor that can create new vents. These vents only connect to each other, forming a new passage way.",
        "morphling": " !camo The Morphling is an Impostor that can Morph into another player. At the beginning of the game and after every meeting, they can choose someone to Sample. They can then Morph into that person at any time for a limited amount of time. To balance the role, they can't vent.",
        "mystic": "The Mystic is a Crewmate that gets an alert revealing when someone has died. On top of this, the Mystic briefly gets an arrow pointing in the direction of the body.",
        "phantom": "The Phantom is a Neutral role with its own win condition. They become half-invisible when they die and has to complete all their tasks without getting caught.",
        "plaguebearer": "The Plaguebearer is a Neutral role with its own win condition, as well as an ability to transform into another role. The Plaguebearer has one ability, which allows them to infect other players. Once infected, the infected player can go and infect other players via interacting with them. Once all players are infected, the Plaguebearer becomes Pestilence. The Pestilence is a unkillable force which can only be killed by being voted out, even their lover dying won't kill them. The Plaguebearer or Pestilence needs to be the last killer alive to win the game.",
        "poisoner": "The Poisoner is an Impostor who has to poison another player instead of kill. When they poison a player, the poisoned player dies either upon the start of the next meeting or after a set duration.",
        "radar": "The Radar is a crewmate who knows where the closest player is to them.",
        "seer": "The Seer is a Crewmate that can reveal the alliance of other players. Based on settings, the Seer can find out whether a player is a Good or an Evil role. A player's name will change color to their team.",
        "sheriff": "The Sheriff is a Crewmate that has the ability to eliminate the Impostors using their kill button. However, if they kill a Crewmate or a Neutral player they can't kill, they instead die themselves.",
        "sleuth": "The Sleuth is a crewmate who gains knowledge from reporting dead bodies. During meetings the Sleuth can see the roles of all players in which they've reported.",
        "snitch": "The Snitch is a Crewmate that can get arrows pointing towards the Impostors, once all their tasks are finished. The names of the Impostors will also show up as red on their screen. Based on the game settings, the Snitch may not know who they are until they have one task left. However, when they only have a single task left, the Impostors get an arrow pointing towards the Snitch.",
        "spy": "The Spy is a Crewmate that gains more information when on Admin Table and Vitals. On Admin Table, the Spy can see the colors of every person on the map.",
        "swapper": "The Swapper is a Crewmate that can swap the votes on 2 players during a meeting. All the votes for the first player will instead be counted towards the second player and vice versa.",
        "swooper": "The Swooper is an Impostor that can temporarily turn invisible. To balance the role, they can't vent.",
        "survivor": "The Survivor is a Neutral role which can win by simply surviving. However, if Lovers, or a Neutral Evil role wins the game, the survivor loses.",
        "tiebreaker": "If any vote is a draw, the Tiebreaker's vote will go through. If they voted another player, they will get voted out. If the Tiebreaker is the Mayor, it applies to the Mayor's first vote.",
        "timelord": "The Time Lord is a Crewmate that can rewind time and reverse the positions of all players. If enabled, any players killed during this time will be revived. Nothing but movements and kills are affected.",
        "tracker": "The Tracker is a Crewmate that can track other players by tracking them during a round. Once they track someone, an arrow is continuously pointing to them, which updates in set intervals.",
        "traitor": "If all Impostors die before a certain point in the game, a random crewmate is selected to become the Traitor. The Traitor has no additional abilities and their job is simply to avenge the dead Impostors. Once this player has turned into the Traitor their alliance sits with the Impostors.",
        "transporter": "The Transporter is a Crewmate that can change the locations of two random players at will. Players who have been transported are alerted with a blue flash on their screen.",
        "trapper": "The Trapper is a Crewmate that can place traps around the map. When players enter a trap they trigger the trap. In the following meeting, all players who triggered a trap will have their role displayed to the trapper. However, this is done so in a random order, not stating who entered the trap, nor what role a specific player is.",
        "underdog": "The Underdog is an Impostor with a prolonged kill cooldown. When they are the only remaining Impostor, they will have their kill cooldown shortened.",
        "undertaker": "The Undertaker is an Impostor that can drag and drop bodies",
        "veteran": "The Veteran is a Crewmate that can go on alert. When the Veteran is on alert, anyone, whether crew, neutral or impostor, if they interact with the Veteran, they die.",
        "vigilante": "The Vigilante is a Crewmate that can kill during meetings. During meetings, the Vigilante can choose to kill someone by guessing their role, however, if they guess incorrectly, they die instead.",
        "werewolf": "The Werewolf is a Neutral role with its own win condition. Although the Werewolf has a kill button, they can't use it unless they are Rampaged. Once the Werewolf rampages they gain Impostor vision and the ability to kill. However, unlike most killers their kill cooldown is really short. The Werewolf needs to be the last killer alive to win the game."
    },
    "aliases": {
        "double shot": "doubleshot",
        "guardian angel": "guardianangel",
        "time lord": "timelord"
    }
}
